cases/uduct/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 290;

boundaryField
{
    ".*Walls.*"
    {
        type            zeroGradient;
        value uniform   290;
    }
    inlet
    {
        type fixedValue;
        value uniform 290;
    }
    outlet
    {
        type inletOutlet;
        inletValue uniform 290;
        outletValue uniform 290;
    }
    frontAndBackPlanes
    {
        type empty;
    }

}

// ************************************************************************* //
