cases/uduct/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    ".*Walls.*"
    {
        type            compressible::kqRWallFunction;
        value           uniform 1e-15;
    }
    inlet
    {
        type fixedValue;
        value uniform 1e-5;
    }
    outlet
    {
        type inletOutlet;
        inletValue uniform 1e-5;
    }
    frontAndBackPlanes
    {
        type empty;
    }
}


// ************************************************************************* //
