cases/uduct/constant/basicThermoCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active          false;
InjectionModel  PatchInjection;
DragModel       none;
DispersionModel none;
PatchInteractionModel StandardWallInteraction;
HeatTransferModel RanzMarshall;
PostProcessingModel none;
radiation       on;
coupled         true;
cellValueSourceCorrection on;
parcelTypeId    1;
constantProperties
{
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 1e-15;
    TMin            TMin [ 0 0 0 1 0 ] 200;
    pMin            pMin [ 1 -1 2 0 0 ] 1000;
    rho0            rho0 [ 1 -3 0 0 0 ] 1000;
    minParticleMass minParticleMass [ 1 0 0 0 0 ] 1e-15;
    T0              T0 [ 0 0 0 1 0 ] 300;
    cp0             cp0 [ 0 2 -2 -1 0 ] 4187;
    epsilon0        epsilon0 [ 0 0 0 0 0 ] 1;
    f0              f0 [ 0 0 0 0 0 ] 0.5;
    Pr              Pr [ 0 0 0 0 0 ] 0.7;
    Tvap            Tvap [ 0 0 0 1 0 ] 273;
    Tbp             Tvap [ 0 0 0 1 0 ] 373;
    constantVolume  true;
}
interpolationSchemes
{
    rho             cell;
    U               cellPointFace;
    mu              cell;
    T               cell;
    Cp              cell;
    p               cell;
}
integrationSchemes
{
    U               Euler;
    T               Analytical;
}
particleForces
{
    gravity         on;
    virtualMass     off;
    pressureGradient on;
}
ManualInjectionCoeffs
{
    massTotal       massTotal [ 1 0 0 0 0 ] 1e-8;
    parcelBasisType mass;
    SOI             0;
    positionsFile   "basicThermoCloud1Positions";
    U0              ( -20 0 0 );
    parcelPDF
    {
        pdfType         uniform;
        uniformPDF
        {
            minValue        1e-06;
            maxValue        1e-06;
        }
    }
}
PatchInjectionCoeffs
{
    SOI             0;
    massTotal       massTotal [ 1 0 0 0 0 ] 8;
    parcelBasisType mass;
    patchName       inlet;
    duration        100000;
    parcelsPerSecond 1000;
    U0              (-20 0 0);
    T0              300;
    volumeFlowRate  constant 0.1;
    parcelPDF
    {
        pdfType         general;
        generalPDF
        {
            distribution
            (
                (10e-06      0.0025)
                (15e-06      0.0528)
                (20e-06      0.2795)
                (25e-06      1.0918)
                (30e-06      2.3988)
                (35e-06      4.4227)
                (40e-06      6.3888)
                (45e-06      8.6721)
                (50e-06      10.3153)
                (55e-06      11.6259)
                (60e-06      12.0030)
                (65e-06      10.4175)
                (70e-06      10.8427)
                (75e-06      8.0016)
                (80e-06      6.1333)
                (85e-06      3.8827)
                (90e-06      3.4688)
            );
        }
    }
}
StandardWallInteractionCoeffs
{
    type            rebound;
}
RanzMarshallCoeffs
{
    BirdCorrection  true;
}

// ************************************************************************* //
